Repository: hossamadel7/Clasrio
Catalog: centrny/Resources/Exam.*.resx
Languages: ar

# Title_ExamManagement
source: Exam Management
ar: إدارة الامتحانات

# AddExamBtn
source: Add Exam
ar: إضافة امتحان

# EditExamBtn
source: Edit Exam
ar: تعديل الامتحان

# DeleteExamBtn
source: Delete Exam
ar: حذف الامتحان

# SaveExamBtn
source: Save Exam
ar: حفظ الامتحان

# CancelBtn
source: Cancel
ar: إلغاء

# ExamNameLabel
source: Exam Name
ar: اسم الامتحان

# ExamTimerLabel
source: Exam Timer
ar: مدة الامتحان

# ExamTimerHelper
source: Format HH:mm
ar: الصيغة HH:mm

# ExamNamePlaceholder
source: Enter exam name
ar: أدخل اسم الامتحان

# EduYearLabel
source: Educational Year
ar: السنة الدراسية

# SubjectLabel
source: Subject
ar: المادة

# YearLabel
source: Year
ar: الصف

# TeacherLabel
source: Teacher
ar: المعلم

# BranchLabel
source: Branch
ar: الفرع

# IsExamLabel
source: Is Exam
ar: امتحان

# IsOnlineLabel
source: Is Online
ar: امتحان إلكتروني

# IsDoneLabel
source: Is Done
ar: تم الانتهاء

# VsQuizLabel
source: vs Quiz
ar: مقارنة بالاختبار القصير

source: Actions
ar: الإجراءات

source: Status
ar: الحالة

source: Type
ar: النوع

source: Mode
ar: الوضع

source: Degree
ar: الدرجة

# SuccessMsg
source: Success
ar: نجاح

# ErrorMsg
source: Error
ar: خطأ

# ConfirmDeleteTitle
source: Delete Exam
ar: حذف الامتحان

# ConfirmDeleteWarning
source: Are you sure you want to delete this exam?
ar: هل أنت متأكد أنك تريد حذف هذا الامتحان؟

# CloseBtn
source: Close
ar: إغلاق

# ViewDetailsBtn
source: View Details
ar: عرض التفاصيل

# ExamStatisticsTitle
source: Exam Statistics
ar: إحصائيات الامتحان

source: Students Completed
ar: الطلاب الذين أكملوا

source: Students Pending
ar: الطلاب بانتظار الإكمال

source: Manage Questions
ar: إدارة الأسئلة

# SaveQuestionsBtn
source: Save Questions
ar: حفظ الأسئلة

# SearchQuestionsPlaceholder
source: Search questions...
ar: ابحث عن الأسئلة...

# SearchBtn
source: Search
ar: بحث

# ClearBtn
source: Clear
ar: مسح

source: Available Questions
ar: الأسئلة المتاحة

source: Chosen Questions
ar: الأسئلة المختارة

# UpdateExamBtn
source: Update Exam
ar: تحديث الامتحان

source: Loading...
ar: جار التحميل...

source: No exams found
ar: لا توجد امتحانات

# GetStartedMsg
source: Click "Add Exam" to get started.
ar: اضغط "إضافة امتحان" للبدء.

source: Page Context
ar: سياق الصفحة

# RootCodeLabel
source: RootCode
ar: كود الجذر

source: Center
ar: المركز

source: Teacher
ar: المعلم

# ActionsHeader
source: Actions
ar: الإجراءات

# ModeHeader
source: Mode
ar: الوضع

# TypeHeader
source: Type
ar: النوع

# StatusHeader
source: Status
ar: الحالة

# BranchHeader
source: Branch
ar: الفرع

# SubjectHeader
source: Subject
ar: المادة

# YearHeader
source: Year
ar: الصف

# EduYearHeader
source: Edu Year
ar: السنة الدراسية

# DurationHeader
source: Duration
ar: المدة

# SuccessHeader
source: % Success
ar: % النجاح

# AvgMarksHeader
source: Avg Marks
ar: متوسط العلامات

# DegreeHeader
source: Degree
ar: الدرجة

# NameHeader
source: Name
ar: الاسم

# CodeHeader
source: Code
ar: الكود

# QuestionsBtn
source: Questions
ar: الأسئلة

# EditBtn
source: Edit
ar: تعديل

# DeleteBtn
source: Delete
ar: حذف

# StatsBtn
source: Stats
ar: إحصائيات

source: Assignment
ar: واجب

source: Exam
ar: امتحان

source: Done
ar: تم

source: Pending
ar: قيد الانتظار

source: Online
ar: إلكتروني

source: Offline
ar: ورقي

# ExamNameRequired
source: Exam name is required.
ar: اسم الامتحان مطلوب.

# ExamTimerRequired
source: Please enter a valid time in HH:MM format.
ar: يرجى إدخال وقت صالح بصيغة HH:MM.

# EduYearRequired
source: Educational year is required.
ar: السنة الدراسية مطلوبة.

# SubjectRequired
source: Subject is required.
ar: المادة مطلوبة.

# YearRequired
source: Year is required.
ar: الصف مطلوب.

# TeacherRequired
source: Teacher is required.
ar: المعلم مطلوب.

# BranchRequired
source: Branch is required.
ar: الفرع مطلوب.

# NoTeacherFound
source: No teacher found for your root.
ar: لم يتم العثور على معلم لجذرك.

# CenterRequired
source: Center is required.
ar: المركز مطلوب.

# SelectCenterOption
source: -- Select Center --
ar: -- اختر المركز --

# SelectBranchOption
source: -- Select Branch --
ar: -- اختر الفرع --

source: Failed to load centers
ar: فشل في تحميل المراكز

source: Failed to load branches
ar: فشل في تحميل الفروع

# ErrorLoadingTeacher
source: Error loading teacher information.
ar: حدث خطأ أثناء تحميل معلومات المعلم.

# SelectEduYearOption
source: -- Select Educational Year --
ar: -- اختر السنة الدراسية --

# FailedToLoadEduYears
source: Failed to load education years
ar: فشل في تحميل السنوات الدراسية

source: Error loading exams
ar: حدث خطأ أثناء تحميل الامتحانات

source: Unknown error
ar: خطأ غير معروف

source: Exams for:
ar: امتحانات لـ:

source: Saving...
ar: جار الحفظ...

# ExamCreatedSuccess
source: Exam created successfully!
ar: تم إنشاء الامتحان بنجاح!

source: Error adding exam
ar: حدث خطأ أثناء إضافة الامتحان

source: Server error occurred
ar: حدث خطأ في الخادم

source: Failed to load exam details
ar: فشل في تحميل تفاصيل الامتحان

source: Updating...
ar: جار التحديث...

# ExamUpdatedSuccess
source: Exam updated successfully!
ar: تم تحديث الامتحان بنجاح!

source: Error updating exam
ar: حدث خطأ أثناء تحديث الامتحان

# ConfirmDeleteExam
source: Are you sure you want to delete this exam? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا الامتحان؟ هذا الإجراء لا يمكن التراجع عنه.

# ExamDeletedSuccess
source: Exam deleted successfully!
ar: تم حذف الامتحان بنجاح!

source: Error deleting exam
ar: حدث خطأ أثناء حذف الامتحان

source: Error
ar: خطأ

# SelectOption
source: -- Select --
ar: -- اختر --

# SelectSubjectOption
source: -- Select Subject --
ar: -- اختر المادة --

# SelectYearOption
source: -- Select Year --
ar: -- اختر الصف --

# SelectTeacherOption
source: -- Select Teacher --
ar: -- اختر المعلم --

source: Failed to load teachers
ar: فشل في تحميل المعلمين

source: Failed to load subjects
ar: فشل في تحميل المواد

source: Failed to load years
ar: فشل في تحميل الصفوف

source: Failed to load exam questions.
ar: فشل في تحميل أسئلة الامتحان.

source: Searching...
ar: جار البحث...

source: No questions found for
ar: لم يتم العثور على أسئلة لـ

# LessonLabel
source: Lesson
ar: الدرس

# AddBtn
source: Add
ar: إضافة

# BackBtn
source: Back
ar: رجوع

source: Error searching questions.
ar: حدث خطأ أثناء البحث عن الأسئلة.

# SelectAtLeastOneQuestion
source: Please select at least one question for the exam.
ar: يرجى اختيار سؤال واحد على الأقل للامتحان.

# QuestionsSavedSuccess
source: Questions saved successfully!
ar: تم حفظ الأسئلة بنجاح!

source: Update failed
ar: فشل التحديث

source: Error saving questions
ar: حدث خطأ أثناء حفظ الأسئلة

source: Chapter
ar: الفصل

source: Lesson
ar: الدرس

# DegreeLabel
source: Degree
ar: الدرجة

source: Page
ar: صفحة

source: of
ar: من

source: Previous
ar: السابق

source: Next
ar: التالي

source: Exam management initialized for:
ar: تم بدء إدارة الامتحانات لـ:

source: Loading statistics...
ar: جار تحميل الإحصائيات...

source: Error loading statistics
ar: حدث خطأ أثناء تحميل الإحصائيات

source: Failed to load exam statistics.
ar: فشل في تحميل إحصائيات الامتحان.
