Repository: hossamadel7/Clasrio
Catalog: centrny/Resources/Login.*.resx
Languages: ar

# Title_Login
source: Login
ar: تسجيل الدخول

# Title_LoginPage
source: Login - Center Management System
ar: تسجيل الدخول - نظام إدارة المركز

# Login_WelcomeBack
source: Welcome Back
ar: مرحبًا بعودتك

# Login_CenterManagementSystem
source: Center Management System
ar: نظام إدارة المركز

# Login_TroubleshootingTitle
source: Troubleshooting Login Issues
ar: مشكلة في تسجيل الدخول

# Login_TroubleshootingHint
source: Press Ctrl+D to find your username • Check database for actual user records
ar: اضغط Ctrl+D للعثور على اسم المستخدم • تحقق من قاعدة البيانات

# Login_UsernamePlaceholder
source: Enter your username
ar: أدخل اسم المستخدم

# Login_PasswordPlaceholder
source: Enter your password
ar: أدخل كلمة المرور

# Login_UsernameRequired
source: Username is required
ar: اسم المستخدم مطلوب

# Login_UsernameMinLength
source: Username must be at least 3 characters
ar: يجب أن يكون اسم المستخدم 3 أحرف على الأقل

# Login_UsernamePattern
source: Username can only contain letters, numbers, and underscores
ar: يمكن أن يحتوي اسم المستخدم على أحرف وأرقام وشرطات سفلية فقط

# Login_PasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# Login_PasswordMinLength
source: Password must be at least 3 characters
ar: يجب أن تكون كلمة المرور 3 أحرف على الأقل

# Login_RememberMe
source: Keep me signed in for 8 hours
ar: تذكرني لمدة 8 ساعات

# Login_SignIn
source: Sign In
ar: تسجيل الدخول

# Login_TroubleshootingLink
source: Troubleshooting Login Issues
ar: حل مشاكل تسجيل الدخول

# Login_PasswordToggle
source: Show/Hide Password
ar: إظهار/إخفاء كلمة المرور

# Login_FindUsername
source: Find Your Username
ar: البحث عن اسم المستخدم

# Login_RunSqlQuery
source: Run this SQL query in your database:
ar: نفذ هذا الاستعلام في قاعدة البيانات:

# Login_CommonTestCredentials
source: Common Test Credentials:
ar: بيانات تجريبية شائعة:

# Login_Close
source: Close
ar: إغلاق

# Login_TroubleshootingSteps
source: Troubleshooting Steps
ar: خطوات حل المشكلة

# Login_Step1
source: Step 1: Check if users exist
ar: الخطوة 1: تحقق من وجود المستخدمين

# Login_Step2
source: Step 2: Verify password hashes
ar: الخطوة 2: تحقق من تشفير كلمة المرور

# Login_Step3
source: Step 3: Create a test user
ar: الخطوة 3: أنشئ مستخدم تجريبي

# Login_TroubleshootingNote
source: Note: Password should automatically hash to MD5. If Group_Code 1 doesn't exist, create a group first or use an existing Group_Code from your database.
ar: ملاحظة: يجب أن تُشفّر كلمة المرور تلقائيًا إلى MD5. إذا لم يكن Group_Code 1 موجودًا، أنشئ مجموعة أولاً أو استخدم رمز مجموعة موجود.

# Login_ShowPassword
source: Show Password
ar: إظهار كلمة المرور

# Login_HidePassword
source: Hide Password
ar: إخفاء كلمة المرور

# Login_SigningIn
source: Signing In...
ar: جاري تسجيل الدخول...
