Repository: hossamadel7/Clasrio
Catalog: centrny/Resources/Pin.*.resx
Languages: ar

# Title_PinsManagement
source: Pins Management
ar: إدارة الأكواد

# Header_PinsManagementSystem
source: Pins Management System
ar: نظام إدارة الأكواد

# Label_Root
source: Root
ar: المركز

# Label_User
source: User
ar: المستخدم

# Wallet_Total_Label
source: Wallet Codes Total Count
ar: إجمالي رصيد المحفظة

# Wallet_1x_Label
source: 1x Wallet Count
ar: رصيد 1 جلسة

# Wallet_4x_Label
source: 4x Wallet Count
ar: رصيد 4 جلسات

# Wallet_16x_Label
source: 16x Wallet Count
ar: رصيد 16 جلسة

# Label_FilterType
source: Filter Type
ar: تصفية حسب النوع

# Label_FilterStatus
source: Filter Status
ar: تصفية حسب الحالة

# Option_AllTypes
source: All Types
ar: كل الأنواع

# Option_Session
source: Session
ar: جلسة

# Option_Exam
source: Exam
ar: امتحان

# Option_AllStatus
source: All Status
ar: كل الحالات

# Option_Used
source: Used
ar: مستخدم

# Option_Active
source: Active
ar: نشط

# Option_Sold
source: Sold
ar: مباع

# Button_GeneratePins
source: Generate Pins
ar: توليد أكواد

# Button_Refresh
source: Refresh
ar: تحديث

# Table_PinsList
source: Pins List
ar: قائمة الأكواد

# Meta_Total
source: Total
ar: الإجمالي

# Meta_Page
source: Page
ar: الصفحة

# Column_PinCode
source: Pin Code
ar: رمز الكود

# Column_Watermark
source: Watermark
ar: العلامة المائية

# Column_Type
source: Type
ar: النوع

# Column_Times
source: Times
ar: عدد الجلسات

# Column_Status
source: Status
ar: الحالة

# Column_StatusToggleHint
source: click to toggle
ar: اضغط للتبديل

# Column_Active
source: Active
ar: مفعل

# Column_Created
source: Created
ar: تاريخ الإنشاء

# Column_Actions
source: Actions
ar: إجراءات

source: No pins found
ar: لا توجد أكواد

# Generate_Type
source: Type
ar: النوع

# Generate_Sessions
source: Sessions
ar: الجلسات

# Generate_Quantity
source: Quantity
ar: الكمية

# Generate_AvailableHintTemplate
source: Available for {0} sessions: {1}
ar: المتاح لـ {0} جلسات: {1}

# Edit_Title
source: Edit Pin
ar: تعديل الكود

# Edit_Watermark
source: Watermark
ar: العلامة المائية

# Edit_Type
source: Type
ar: النوع

# Edit_Sessions
source: Sessions
ar: الجلسات

# Edit_Status
source: Status
ar: الحالة

# Edit_Active
source: Active
ar: مفعل

# Edit_UpdatePin
source: Update Pin
ar: تحديث الكود

# Msg_RefreshingPins
source: Refreshing pins...
ar: جارٍ تحديث الأكواد...

# Msg_PinsRefreshed
source: Pins refreshed successfully!
ar: تم تحديث الأكواد بنجاح!

# Msg_UsedPinsCannotToggle
source: Used pins cannot be toggled.
ar: لا يمكن تبديل حالة الكود المستخدم.

# Msg_ToggleFailed
source: Failed to toggle pin status.
ar: فشل تبديل حالة الكود.

# Msg_RequestedExceedsAvailableTemplate
source: Requested quantity ({0}) exceeds available balance ({1}) for {2} sessions.
ar: الكمية المطلوبة ({0}) أكبر من الرصيد المتاح ({1}) لـ {2} جلسات.

# Msg_PinsGeneratedSuccess
source: Pins generated successfully!
ar: تم توليد الأكواد بنجاح!

# Msg_FailedGeneratePins
source: Failed to generate pins
ar: فشل توليد الأكواد

# Msg_UnexpectedGenerate
source: Unexpected error during generation
ar: حدث خطأ غير متوقع أثناء التوليد

# Msg_PinUpdatedSuccess
source: Pin updated successfully!
ar: تم تحديث الكود بنجاح!

# Msg_FailedUpdatePin
source: Failed to update pin
ar: فشل تحديث الكود

# Msg_UnexpectedUpdatePin
source: Unexpected error during update
ar: حدث خطأ غير متوقع أثناء التحديث

# Msg_PinDeletedSuccess
source: Pin deleted successfully!
ar: تم حذف الكود بنجاح!

# Msg_FailedDeletePin
source: Failed to delete pin
ar: فشل حذف الكود

# Msg_UnexpectedDeletePin
source: Unexpected error deleting pin
ar: حدث خطأ غير متوقع أثناء الحذف

# Type_Exam
source: Exam
ar: امتحان

# Type_Session
source: Session
ar: جلسة

# Status_Used
source: Used
ar: مستخدم

# Status_Active
source: Active
ar: نشط

# Status_Sold
source: Sold
ar: مباع
