Repository: hossamadel7/Clasrio
Catalog: centrny/Resources/Reports.*.resx
Languages: ar

source: Class Attendance Report
ar: تقرير حضور الحصص

source: Class Attendance
ar: حضور الحصة

# MonitorSubtitle
source: Monitor and manage student attendance
ar: راقب وتابع حضور الطلاب

source: Teacher
ar: المعلم

source: All Teachers
ar: كل المعلمين

source: Subject
ar: المادة

source: All Subjects
ar: كل المواد

source: Date
ar: التاريخ

source: Apply
ar: تطبيق

source: Clear
ar: مسح

source: Reset Filters
ar: إعادة ضبط الفلاتر

# LoadingAttendance
source: Loading attendance data...
ar: جاري تحميل بيانات الحضور...

source: No Classes Found
ar: لا توجد حصص

# NoClassesMatch
source: No classes match the selected criteria. Try adjusting your filters to see more results.
ar: لا توجد حصص مطابقة للمعايير المحددة. جرب تغيير الفلاتر لرؤية نتائج أكثر.

source: Enrolled
ar: مسجلين

source: Present
ar: حاضر

source: Absent
ar: غائب

source: Rate
ar: النسبة

source: Attendance Rate
ar: الحضور

source: Branch
ar: الفرع

source: Hall
ar: القاعة

source: Students
ar: الطلاب

source: Attendance
ar: الحضور

source: Manage Attendance
ar: إدارة الحضور

# PaginationInfo
source: Showing {start} to {end} of {total} classes
ar: عرض من {start} إلى {end} من أصل {total} حصص

# LoadingErrorTitle
source: Error Loading Data
ar: خطأ في تحميل البيانات

# LoadingErrorText
source: Failed to load attendance data:
ar: فشل تحميل بيانات الحضور:

source: Previous
ar: السابق

source: Next
ar: التالي

# PreparingExport
source: Preparing {format} export...
ar: جاري تجهيز تصدير {format}...

source: Preparing class export...
ar: جاري تجهيز تصدير الحصة...

# NoAbsentParentPhones
source: No absent students with parent phone numbers found.
ar: لا يوجد طلاب غائبين لديهم رقم ولي أمر

# AbsentSmsDefault
source: Dear Parent, your child was absent from today's {class} class. Please contact the school for more information.
ar: ولي الأمر العزيز، ابنكم غائب عن حصة اليوم {class}. يرجى التواصل مع المدرسة لمزيد من المعلومات.

# AbsentSmsDefaultGlobal
source: Dear Parent, your child was absent from today's class. Please contact the school for more information.
ar: ولي الأمر العزيز، ابنكم غائب عن حصة اليوم. يرجى التواصل مع المدرسة لمزيد من المعلومات.

# AbsentSmsIndividual
source: Dear Parent, {name} was absent from today's class. Please contact the school for more information.
ar: ولي الأمر العزيز، {name} غائب عن حصة اليوم. يرجى التواصل مع المدرسة لمزيد من المعلومات.

# PleaseEnterMessage
source: Please enter a message.
ar: يرجى إدخال الرسالة.

# SmsError
source: Error sending SMS:
ar: خطأ في إرسال الرسالة:

# SmsFailed
source: Failed to send SMS:
ar: فشل إرسال الرسالة:

# NoParentPhoneFor
source: No parent phone number available for {name}
ar: لا يوجد رقم ولي أمر لـ {name}

# WouldCallAbsentParents
source: Would call {count} parents of absent students
ar: سيتم الاتصال بـ {count} أولياء أمور الطلاب الغائبين

# AttendanceUpdateError
source: Error updating attendance:
ar: خطأ في تحديث الحضور:

# AttendanceUpdateFailed
source: Failed to update attendance:
ar: فشل تحديث الحضور:

# NoSelectedInClass
source: No students selected in this class.
ar: لم يتم تحديد أي طالب في هذه الحصة.

source: No students selected.
ar: لم يتم تحديد أي طالب.

# AttendanceUpdatedFor
source: Attendance updated for {count} students
ar: تم تحديث الحضور لـ {count} طالب

source: My Classes Report
ar: تقرير حصصي

# MyClassesReportSubtitle
source: Track your teaching schedule and performance
ar: تتبع جدول التدريس والأداء الخاص بك

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: Per Page
ar: لكل صفحة

source: Filter
ar: تصفية

source: Quick ranges:
ar: نطاقات سريعة:

source: This Week
ar: هذا الأسبوع

source: This Month
ar: هذا الشهر

source: Last Month
ar: الشهر الماضي

source: Total Classes
ar: إجمالي الحصص

source: Avg. Students
ar: متوسط الطلاب

source: Avg. Attendance
ar: متوسط الحضور

source: Total Earnings
ar: إجمالي الأرباح

source: Time
ar: الوقت

source: Earning
ar: الربح

source: Details
ar: تفاصيل

# ExportPDF
source: Export to PDF
ar: تصدير PDF

# ExportExcel
source: Export to Excel
ar: تصدير Excel

# NoClassesHint
source: Try adjusting your filters to see your class data.
ar: جرّب ضبط الفلاتر لرؤية بيانات حصصك.

source: Class Details
ar: تفاصيل الحصة

source: Class Code
ar: رمز الحصة

# ClassDetailsInfo
source: Detailed class information will be implemented here.
ar: سيتم تنفيذ معلومات الحصة التفصيلية هنا.

# ClassDetailsInclude
source: This could include:
ar: قد يشمل:

# ClassDetailsStudentList
source: Complete student list
ar: قائمة الطلاب الكاملة

# ClassDetailsLessonPlan
source: Lesson plan details
ar: تفاصيل خطة الدرس

# ClassDetailsAssignments
source: Assignment information
ar: معلومات الواجبات

# ClassDetailsMetrics
source: Performance metrics
ar: مقاييس الأداء

source: Close
ar: إغلاق

source: Loading...
ar: جاري التحميل...

source: Error loading class details.
ar: خطأ في تحميل تفاصيل الحصة.

source: No Date
ar: بدون تاريخ

source: Reports Dashboard
ar: لوحة تقارير النظام

# ReportsDashboardSubtitle
source: Comprehensive reporting system for educational management
ar: نظام تقارير شامل لإدارة التعليم

source: Center Management Reports
ar: تقارير إدارة المركز

# FinancialSummaryDesc
source: Revenue, expenses, and profitability analysis
ar: تحليل الإيرادات والمصروفات والربحية

# FinancialSummaryFilters
source: Date range, branch, subject
ar: نطاق التاريخ، الفرع، المادة

# ExportOptions
source: PDF, Excel formats available
ar: متوفر بصيغ PDF و Excel

source: View Report
ar: عرض التقرير

# StudentEnrollmentDesc
source: Student registration and enrollment trends
ar: اتجاهات تسجيل الطلاب والاشتراك

# StudentEnrollmentFilters
source: Branch, subject, year, enrollment date
ar: الفرع، المادة، السنة، تاريخ التسجيل

# StudentEnrollmentIncludes
source: Contact info, subscription status
ar: معلومات الاتصال، حالة الاشتراك

source: Performance
ar: الأداء

# TeacherPerformanceDesc
source: Teaching effectiveness and attendance rates
ar: فاعلية التدريس ونسب الحضور

# TeacherPerformanceFilters
source: Teacher, subject, date range
ar: المعلم، المادة، نطاق التاريخ

# TeacherPerformanceMetrics
source: Attendance rates, earnings, class count
ar: نسب الحضور، الأرباح، عدد الحصص

source: Academic
ar: الأكاديمية

# ExamPerformanceDesc
source: Overall exam results and success rates
ar: نتائج الامتحانات ونسب النجاح العامة

# ExamPerformanceFilters
source: Branch, subject, teacher, exam type
ar: الفرع، المادة، المعلم، نوع الامتحان

# ExamPerformanceAnalytics
source: Pass rates, average scores, trends
ar: نسب النجاح، المعدلات، الاتجاهات

# AttendanceAndClassReports
source: Attendance & Class Reports
ar: تقارير الحضور والحصص

# ClassAttendanceDesc
source: Enrolled vs attended students per class
ar: الطلاب المسجلين مقابل الحاضرين لكل حصة

# ClassAttendanceFilters
source: Teacher, subject, specific date
ar: المعلم، المادة، تاريخ محدد

# ClassAttendanceShows
source: Present/absent lists with contact info
ar: قوائم الحضور/الغياب مع معلومات الاتصال

source: Compare
ar: مقارنة

source: Shows
ar: يظهر

source: Filter by
ar: تصفية حسب

source: Metrics
ar: المقاييس

source: Analytics
ar: التحليلات

source: Period
ar: الفترة

source: Includes
ar: يتضمن

source: Coming Soon
ar: قريباً

source: Branch Performance
ar: أداء الفروع

# BranchPerformanceDesc
source: Performance across all branches
ar: مقارنة الأداء عبر جميع الفروع

# BranchPerformanceMetrics
source: Revenue, enrollment, attendance
ar: الإيرادات، التسجيل، الحضور

# BranchPerformancePeriod
source: Monthly, quarterly, yearly
ar: شهري، ربع سنوي، سنوي

source: Quick Statistics
ar: إحصائيات سريعة

source: Active Students
ar: الطلاب النشطون

source: Classes This Month
ar: حصص هذا الشهر

source: Monthly Revenue
ar: إيرادات هذا الشهر

source: My Teaching Reports
ar: تقاريري التدريسية

source: Classes
ar: الحصص

source: My Classes
ar: حصصي

# MyClassesDesc
source: Your scheduled and completed classes
ar: الحصص المجدولة والمكتملة الخاصة بك

# MyClassesFilters
source: Date range, subject
ar: نطاق التاريخ، المادة

# MyClassesIncludes
source: Attendance rates, earnings
ar: نسب الحضور، الأرباح

source: My Students
ar: طلابي

# MyStudentsDesc
source: Performance of your enrolled students
ar: أداء الطلاب المسجلين لديك

# MyStudentsFilters
source: Subject, year level
ar: المادة، المستوى

# MyStudentsIncludes
source: Attendance rates, contact info
ar: نسب الحضور، معلومات الاتصال

source: Earnings
ar: الأرباح

source: My Earnings
ar: أرباحي

# MyEarningsDesc
source: Your teaching earnings and payments
ar: أرباح التدريس والمدفوعات الخاصة بك

# MyEarningsFilters
source: Date range, subject
ar: نطاق التاريخ، المادة

source: Breakdown
ar: تفصيل

# MyEarningsBreakdown
source: Per class, monthly, quarterly totals
ar: لكل حصة، شهري، ربع سنوي

source: Financial Summary Report
ar: تقرير الملخص المالي

# FinancialSummarySubtitle
source: Revenue analysis and financial performance tracking
ar: تحليل الإيرادات وتتبع الأداء المالي

source: All Branches
ar: كل الفروع

source: This Quarter
ar: هذا الربع

source: Teacher Payments
ar: دفعات المعلمين

source: Profit Analysis
ar: تحليل الربحية

source: Margin
ar: هامش

# AvgPerClass
source: Average per Class
ar: متوسط لكل حصة

# AvgPerStudent
source: Average per Student
ar: متوسط لكل طالب

source: Teacher Cost Ratio
ar: نسبة تكلفة المعلم

source: Financial Details
ar: تفاصيل مالية

source: Class
ar: الحصة

# MarginPercent
source: Margin %
ar: هامش %

source: Page Totals
ar: إجمالي الصفحة

source: No financial data found
ar: لا توجد بيانات مالية

# FinancialNoDataHint
source: Try adjusting your date range or branch filter to see financial information.
ar: جرّب تعديل نطاق التاريخ أو الفرع لرؤية البيانات المالية.
