Repository: hossamadel7/Clasrio
Catalog: centrny/Resources/Reservation.*.resx
Languages: ar

# ReservationsTitle
source: Reservations
ar: الحجوزات

# BranchLabel
source: Branch
ar: الفرع

# DateLabel
source: Date
ar: التاريخ

# SelectBranchOption
source: Select Branch
ar: اختر الفرع

# SelectTeacherOption
source: Select Teacher
ar: اختر المدرس

# NoBranchSelected
source: Please select a branch.
ar: يرجى اختيار الفرع.

# NoDataFound
source: No data found for this branch and date.
ar: لا توجد بيانات لهذا الفرع والتاريخ.

source: Failed to load grid.
ar: فشل في تحميل الجدول.

# HallHeader
source: Hall
ar: القاعة

# AddReservationBtn
source: Add Reservation
ar: إضافة حجز

# EditReservationBtn
source: Edit Reservation
ar: تعديل الحجز

# AddReservationTitle
source: Add Reservation
ar: إضافة حجز

# EditReservationTitle
source: Edit Reservation
ar: تعديل الحجز

# TeacherLabel
source: Teacher
ar: المدرس

# FirstTimeBtn
source: First time?
ar: لأول مرة؟

# DescriptionLabel
source: Description
ar: الوصف

# CapacityLabel
source: Capacity
ar: السعة

# CostLabel
source: Cost
ar: التكلفة

# StartTimeLabel
source: Start Time
ar: وقت البدء

# EndTimeLabel
source: End Time
ar: وقت الانتهاء

# PeriodLabel
source: Period (calculated)
ar: الفترة (محسوبة)

# DepositLabel
source: Deposit
ar: العربون

# FinalCostLabel
source: Final Cost
ar: التكلفة النهائية

# AddTeacherTitle
source: Add New Teacher
ar: إضافة مدرس جديد

# TeacherNameLabel
source: Name
ar: الاسم

# TeacherPhoneLabel
source: Phone
ar: الهاتف

# TeacherAddressLabel
source: Address
ar: العنوان

# AddTeacherBtn
source: Add Teacher
ar: إضافة مدرس

# CloseBtn
source: Close
ar: إغلاق

# SuccessAddTeacher
source: Teacher added successfully!
ar: تمت إضافة المدرس بنجاح!

# FailedAddTeacher
source: Failed to add teacher.
ar: فشل في إضافة المدرس.

# SaveChangesBtn
source: Save Changes
ar: حفظ التغييرات

# EditBtn
source: Edit
ar: تعديل

# DeleteBtn
source: Delete
ar: حذف

# DeleteConfirm
source: Are you sure you want to delete this reservation?
ar: هل أنت متأكد أنك تريد حذف هذا الحجز؟

# FailedAddReservation
source: Failed to add reservation:
ar: فشل في إضافة الحجز:

# FailedEditReservation
source: Failed to edit reservation:
ar: فشل في تعديل الحجز:

# FailedDeleteReservation
source: Failed to delete reservation.
ar: فشل في حذف الحجز.

# Session_1
source: 1st Session
ar: الحصة الأولى

# Session_2
source: 2nd Session
ar: الحصة الثانية

# Session_3
source: 3rd Session
ar: الحصة الثالثة

# Session_4
source: 4th Session
ar: الحصة الرابعة

# Session_5
source: 5th Session
ar: الحصة الخامسة

# Session_6
source: 6th Session
ar: الحصة السادسة

# Session_7
source: 7th Session
ar: الحصة السابعة

# Session_8
source: 8th Session
ar: الحصة الثامنة

# Session_9
source: 9th Session
ar: الحصة التاسعة

# Session_10
source: 10th Session
ar: الحصة العاشرة
