Repository: hossamadel7/Clasrio
Catalog: centrny/Resources/Subject.*.resx
Languages: ar

# Subject_ListTitle
source: Subjects List
ar: قائمة المواد

# Subject_AddBtn
source: Add Subject
ar: إضافة مادة

# Subject_EditBtn
source: Edit Subject
ar: تعديل المادة

# Subject_NameLabel
source: Subject Name
ar: اسم المادة

# Subject_IsPrimaryLabel
source: Is Primary?
ar: أساسية؟

# Subject_Yes
source: Yes
ar: نعم

# Subject_No
source: No
ar: لا

# Subject_YearLabel
source: Year
ar: السنة

# Subject_Submit
source: Submit
ar: إرسال

# Subject_EditModalTitle
source: Edit Subject
ar: تعديل المادة

# Subject_AddModalTitle
source: Add Subject
ar: إضافة مادة

# Subject_Close
source: Delete
ar: مسح

# Subject_LoadingYears
source: Loading...
ar: جاري التحميل...

# Subject_NoActiveYears
source: No active years
ar: لا توجد سنوات نشطة

# Subject_ErrorLoadingYears
source: Error loading years
ar: خطأ في تحميل السنوات

# Subject_PleaseFillFields
source: Please fill in all fields.
ar: يرجى تعبئة جميع الحقول.

# Subject_CouldNotAdd
source: Could not add subject
ar: تعذر إضافة المادة

# Subject_CouldNotEdit
source: Could not edit subject
ar: تعذر تعديل المادة

# Subject_CouldNotDelete
source: Could not delete subject
ar: تعذر حذف المادة

# Subject_DeleteConfirm
source: Are you sure you want to delete this subject?
ar: هل أنت متأكد أنك تريد حذف هذه المادة؟

# Subject_Actions
source: Actions
ar: إجراءات

# Subject_YearName
source: Year Name
ar: اسم السنة

# Subject_IsPrimary
source: Is Primary
ar: أساسية

# Subject_Unauthorized
source: Unauthorized. Please log in.
ar: غير مصرح. يرجى تسجيل الدخول.

# Subject_NotFound
source: Your group or root was not found.
ar: لم يتم العثور على المجموعة أو الأصل.

# Subject_NoSubjects
source: No subjects found for your group.
ar: لا توجد مواد لهذه المجموعة.

# Subject_ErrorLoading
source: An error occurred loading subjects.
ar: حدث خطأ أثناء تحميل المواد.

# Subject_AssignTeacher
source: Assign Teacher
ar: تعيين معلم

# Subject_Processing
source: Processing...
ar: جاري المعالجة...

# Subject_AddTeacher
source: Add Teacher
ar: إضافة معلم

# Subject_ShowTeachers
source: Show Teachers
ar: عرض المعلمين

# Subject_CouldNotAssignTeacher
source: Could not assign teacher
ar: تعذر تعيين المعلم

# Subject_NoTeachersAssigned
source: No teachers assigned.
ar: لا يوجد معلمون مخصصون.

# Subject_AssignTeacherToSubjectTitle
source: Assign Teacher to Subject
ar: تعيين معلم على المادة

# Subject_TeacherLabel
source: Teacher
ar: المعلم

# Subject_BranchLabel
source: Branch
ar: الفرع

# Subject_CenterPercentageLabel
source: Center Percentage
ar: نسبة المركز

# Subject_CenterAmountLabel
source: Center Amount
ar: مبلغ المركز

# Subject_CouldNotAssignTeacher_Server
source: Could not assign teacher: {0}
ar: تعذر تعيين المعلم: {0}

# Subject_InvalidData
source: Invalid data.
ar: بيانات غير صالحة.

# Subject_TeacherNotFound
source: Teacher not found.
ar: المعلم غير موجود.

# Subject_BranchNotFound
source: Branch not found.
ar: الفرع غير موجود.

# Subject_CouldNotDetermineEduYear
source: Could not determine EduYearCode for the selected year.
ar: تعذر تحديد سنة التعليم للسنة المختارة.

# Subject_SubjectNotFound
source: Subject not found.
ar: المادة غير موجودة.

# Subject_SuccessTeacherAssigned
source: Teacher assigned to subject successfully.
ar: تم تعيين المعلم على المادة بنجاح.
