Repository: hossamadel7/Clasrio
Catalog: centrny/Resources/ViewAuthority.*.resx
Languages: ar

# Title_GroupPagePermissions
source: Group-Page Permissions
ar: إدارة صلاحيات الصفحات للمجموعات

# UserInfo_SelectRoot
source: Select a root to manage group-page permissions in a modern UI.
ar: اختر جذرًا لإدارة صلاحيات الصفحات للمجموعات بواجهة حديثة.

# Label_SelectRoot
source: Select Root:
ar: اختر الجذر:

# Dropdown_SelectRootDefault
source: -- Choose Root --
ar: -- اختر الجذر --

# Groups_Header
source: Groups
ar: المجموعات

# Pages_Header
source: Pages
ar: الصفحات

# Button_AddSelectedPages
source: Add Selected Pages
ar: إضافة الصفحات المحددة

# Permissions_Set
source: Set Permissions for
ar: تعيين الصلاحيات لـ

# Label_Insert
source: Insert
ar: إدراج

# Label_Update
source: Update
ar: تعديل

# Label_Delete
source: Delete
ar: حذف

# Button_SavePermission
source: Save Permission
ar: حفظ الصلاحية

# Existing_GroupPages_Header
source: Existing Group-Page Permissions for Selected Group
ar: الصلاحيات الحالية للمجموعة المختارة

# Table_Page
source: Page
ar: الصفحة

# Table_Insert
source: Insert
ar: إدراج

# Table_Update
source: Update
ar: تعديل

# Table_Delete
source: Delete
ar: حذف

# Table_DeletePage
source: Delete Page
ar: حذف الصفحة

source: No groups found.
ar: لا توجد مجموعات.

source: No pages found.
ar: لا توجد صفحات.

# NoPagesAvailable
source: No pages available for this group.
ar: لا توجد صفحات متوفرة لهذه المجموعة.

# NoGroupPagePermissions
source: No group-page permissions for this group.
ar: لا توجد صلاحيات صفحات لهذه المجموعة.

# Alert_SelectAtLeastOnePage
source: Please select at least one page.
ar: يرجى تحديد صفحة واحدة على الأقل.

# Alert_PermissionsSaved
source: Permissions saved!
ar: تم حفظ الصلاحيات!

# Alert_SaveFailed
source: Save failed.
ar: فشل الحفظ.

# Alert_DeleteFailed
source: Delete failed.
ar: فشل الحذف.

# Confirm_DeletePermission
source: Are you sure you want to delete this permission?
ar: هل أنت متأكد أنك تريد حذف هذه الصلاحية؟
